{
  "nodes": [
    {
      "op": "null", 
      "name": "p0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p1", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_tachikoma_main_0", 
      "attrs": {
        "num_outputs": "1", 
        "global_symbol": "tvmgen_default_tachikoma_main_0", 
        "Compiler": "tachikoma", 
        "flatten_data": "0", 
        "hash": "473570a4120ccf14", 
        "func_name": "tvmgen_default_tachikoma_main_0", 
        "num_inputs": "2"
      }, 
      "inputs": [
        [
          0, 
          0, 
          0
        ], 
        [
          1, 
          0, 
          0
        ]
      ]
    }
  ], 
  "arg_nodes": [0, 1], 
  "heads": [
    [
      2, 
      0, 
      0
    ]
  ], 
  "attrs": {
    "dltype": [
      "list_str", 
      [
        "float32", 
        "float32", 
        "float32"
      ]
    ], 
    "shape": [
      "list_shape", 
      [
        [1, 10], 
        [1, 10], 
        [1, 10]
      ]
    ], 
    "device_index": [
      "list_int", 
      [1, 1, 1]
    ], 
    "storage_id": [
      "list_int", 
      [0, 1, 2]
    ]
  }, 
  "node_row_ptr": [0, 1, 2, 3]
}